#include <iostream>
#include <cmath>
using namespace std;

//Задача первая, №1, 1.	Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.

void task1() {
    double a, b;
    cin >> a >> b;
    cout << sqrt(a * a + b * b) << endl;
}

//Задача вторая, №2. 2. Длина Московской кольцевой автомобильной дороги —109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. На какой отметке он остановится через t часов?
void task2() {
    double v, t;
    cin >> v >> t;
    cout << fmod(v * t, 109.0) << endl;
}

int main(){
    task1();
    task2();
    return 0;
}